<template>
  <div class="about">
    <h2>ผลการเรียนรู้</h2>
    <p>สังเกตการแบ่งนิวเคลียสแบบไมโทซิสและแบบไมโอซิสจากตัวอย่างภายใต้กล้องจลุ ทรรศน์พร้อมทั้งอธิบายและเปรียบเทียบการแบ่งนิวเคลียสแบบไมโทซิสและแบบไมโอซิส</p>
    <h2>จุดประสงค์การเรียนรู้</h2>
    <p>1. ระบุชนิดของการแบ่งเซลล์และบอกความสำคัญของการแบ่งเซลล์แบบไมโทซิสและไมโอซิส</P>
    <p>2. อธิบายความหมายของฮอมอโลกัสโครโมโซม เซลล์ดิพลอยด์ เซลล์แฮพลอยด์</P>
    <p>3. อธิบายวัฏจักรเซลล์</P>
    <p>4. อธิบายการเปลี่ยนแปลงของนิวเคลียสในการแบ่งเซลล์แบบไมโทซิส</P>
    <p>5. อธิบายการเปลี่ยนแปลงของนิวเคลียสในการแบ่งเซลล์แบบไมโอซิส</P>
    <p>6. อธิบายและเปรียบเทียบเซลล์ที่ได้จากการแบ่งแบบไมโทซิสและแบบไมโอซิส</P>
    <b-table :items="items" class="mx-auto" outlined></b-table>
  </div>
</template>

<script>
  export default {
    name: 'About',
    data() {
      return {
        items: [
          { ทักษะกระบวนการทางวิทยาศาสตร์: '1. การสังเกต', ทักษะแห่งศตวรรษ: '1. การสื่อสารสารสนเทศและการรู้เท่าทันสื่อ', จิตวิทยาศาสตร์:'1. ความอยากรู้อยากเห็น' },
          { ทักษะกระบวนการทางวิทยาศาสตร์: '2. การจำแนกประเภท', ทักษะแห่งศตวรรษ: '2. การคิดอย่างมีวิจารณญาณและการแก้ปัญหา', จิตวิทยาศาสตร์:'2. ความเชื่อมั่นต่อหลักฐานเชิงประจักษ์' },
          { ทักษะกระบวนการทางวิทยาศาสตร์: '3. การจัดกระทำและสื่อความหมายข้อมูล', ทักษะแห่งศตวรรษ: '3. ความร่วมมือ การทำงานเป็นทีมและภาวะผู้นำ', จิตวิทยาศาสตร์:'3. ความมุ่งมั่นอดทน' },
          { ทักษะกระบวนการทางวิทยาศาสตร์: '4. การสร้างแบบจำลอง'  },
          { ทักษะกระบวนการทางวิทยาศาสตร์: '5. การตีความหมายข้อมูลและลงข้อสรุป'  },
        ]
      }
    }
  }
</script>

<style>
  .about {
  font-family: Avenir, Helvetica, Arial, sans-serif;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  text-align: left;
  text-indent: 50px;
  margin-right: 150px;
  margin-left: 80px;
}
</style>
